trunk/system/09测试/web/siege_test.txt
siege -c 250 -r 10 -f url_list_from_big.txt
Transactions:                   2500 hits
Availability:                 100.00 %
Elapsed time:                  35.56 secs
Data transferred:              11.00 MB
Response time:                  1.81 secs
Transaction rate:              70.30 trans/sec
Throughput:                     0.31 MB/sec
Concurrency:                  126.95
Successful transactions:        2500
Failed transactions:               0
Longest transaction:           24.93
Shortest transaction:           0.01

CPU: 65%us 25%sy 10%si  LA: 4
MySQL: 106.52 queres , Max used connections 29


siege -c 250 -r 10 -f url_list_from_sml.txt
Transactions:                   2500 hits
Availability:                 100.00 %
Elapsed time:                  31.75 secs
Data transferred:              10.92 MB
Response time:                  1.83 secs
Transaction rate:              78.74 trans/sec
Throughput:                     0.34 MB/sec
Concurrency:                  144.34
Successful transactions:        2500
Failed transactions:               0
Longest transaction:           21.69
Shortest transaction:           0.01

CPU: 65%us 25%sy 10%si  LA: 3
MySQL: 151.71 queres , Max used connections 20


siege -c 250 -r 100 -f url_detail_from_big.txt
Transactions:                  25000 hits
Availability:                 100.00 %
Elapsed time:                 190.76 secs
Data transferred:             101.89 MB
Response time:                  1.19 secs
Transaction rate:             131.05 trans/sec
Throughput:                     0.53 MB/sec
Concurrency:                  155.90
Successful transactions:       25000
Failed transactions:               0
Longest transaction:           22.68
Shortest transaction:           0.01

CPU: 55%us 35%sy 10%si  LA: 6.5  process: 160
MySQL: 227.12 queres , Max used connections 31


siege -c 250 -r 100 -f url_detail_from_sml.txt
Transactions:                  25000 hits
Availability:                 100.00 %
Elapsed time:                 218.49 secs
Data transferred:             101.80 MB
Response time:                  1.47 secs
Transaction rate:             114.42 trans/sec
Throughput:                     0.47 MB/sec
Concurrency:                  168.76
Successful transactions:       25000
Failed transactions:               0
Longest transaction:           21.88
Shortest transaction:           0.00

CPU: 55%us 35%sy 10%si  LA: 5.5  process: 160
MySQL: 297.61 queres , Max used connections 36


siege -c 250 -r 100 -f url_detail_cache.txt
Transactions:                  25000 hits
Availability:                 100.00 %
Elapsed time:                 188.28 secs
Data transferred:              95.34 MB
Response time:                  1.18 secs
Transaction rate:             132.78 trans/sec
Throughput:                     0.51 MB/sec
Concurrency:                  157.17
Successful transactions:       25000
Failed transactions:               0
Longest transaction:           19.31
Shortest transaction:           0.04

CPU: 55%us 35%sy 10%si  LA: 5.2  process: 160


list_sml_sql_exemple: 
SQL QUERY: SELECT * FROM db8.goods_87 WHERE shop_id=780259 limit 0, 20
SQL QUERY: SELECT count(*) FROM db8.goods_87 WHERE shop_id=780259

list_big_sql_exemple:
SQL QUERY: SELECT * FROM goods WHERE shop_id=780259 limit 0, 20
SQL QUERY: SELECT count(*) FROM goods WHERE shop_id=780259

detail_sml_sql_exemple:
SQL QUERY: SELECT list.*, detial.* FROM db8.goods_87 AS list LEFT JOIN db8.goodsDetail_87 AS detial ON list.id = detial.goodsId WHERE list.id = 645498 

detail_big_sql_exemple:
SQL QUERY: SELECT list.*, detial.* FROM goods AS list LEFT JOIN goodsDetail AS detial ON list.id = detial.goodsId WHERE list.id = 645498